In [2]:
from src.GUI.Filters import *
from src.GUI.Tree import Tree
from src.GUI.gui import App
from src.GUI.FilterHandler import FilterHandler
from src.GUI.Menu import Menu
from src.Database.ScoobyDooDatabase import ScoobyDooDatabase
from src.Utils import *
from src.Entities import *

from mysql import connector
import warnings


warnings.filterwarnings('ignore')

%load_ext autoreload
%autoreload 2

In [3]:
main_db: ScoobyDooDatabase = ScoobyDooDatabase()

In [41]:
# main_db.create_culprit(Culprit(541, 'bad guy', 'male'))
# main_db.update_culprit(Culprit('', 'bad guy', 'male'), 541)
# main_db.add_episode_culprit(580,542)
# main_db.delete_single_episode_culprit(580, 541)
main_db.delete_culprit(542)

# print(main_db.create_culprit('test culprit 19', 'male')['culprit_id'][0])
# print(main_db.create_episode('test series 21', 9, 'test 9', 'test date 9', 9, 'FALSE', 'test motive 9'))
# main_db.refresh_cursor()
# sql = f'''CALL Create_Culprit('test culprit 16', 'male')'''

In [42]:
main_db.refresh_cursor()
sql = '''SELECT * FROM Culprits'''
pd.read_sql(sql, main_db.database)

     culprit_id         culprit_name culprit_gender  is_deleted
0             1          Mr. Wickles           Male           0
1             2        Cptn. Cuttler           Male           0
2             3  Bluestone the Great           Male           0
3             4                 Hank           Male           0
4             5          Buck Master           Male           0
..          ...                  ...            ...         ...
503         538      test culprit 17           male           0
504         539      test culprit 19           male           0
505         540      test culprit 50           male           0
506         541              bad guy           male           1
507         542              bad guy           male           1

[508 rows x 4 columns]

In [32]:
main_db.refresh_cursor()
sql = '''SELECT * FROM Episode_Culprits'''
pd.read_sql(sql, main_db.database)

     episode_id  culprit_id  is_deleted_episode_culprits
0             1           1                            0
1             2           2                            0
2             3           3                            0
3             4           4                            0
4             5           5                            0
..          ...         ...                          ...
517         540         158                            0
518         580         541                            0
519         579         541                            0
520         579         542                            1
521         580         542                            1

[522 rows x 3 columns]

In [29]:
# main_db.create_setting(Setting('Desert', 'Home'))
# main_db.update_setting(Setting('Rural', 'Home'), 132)
main_db.delete_setting(137)

In [30]:
main_db.refresh_cursor()
sql = '''SELECT * FROM Settings'''
pd.read_sql(sql, main_db.database)

     setting_id setting_terrain  setting_place  is_deleted
0             1           Urban  United States           0
1             2           Coast  United States           0
2             3          Island  United States           0
3             4            Cave     California           0
4             5          Desert  United States           0
..          ...             ...            ...         ...
132         133            Snow           Home           1
133         134            Cave           Home           1
134         135          Island           Home           1
135         136           Coast           Home           1
136         137          Desert           Home           1

[137 rows x 4 columns]

In [27]:
# main_db.create_episode_details(Episode('', '', 'test series 1', 1, 'test 1', 'test date 1', 1, 'FALSE', 'test motive 1'))
main_db.add_episode_setting(580, 137)
# main_db.delete_episode(579)

In [31]:
main_db.refresh_cursor()
sql = '''SELECT * FROM Episode_Details'''
pd.read_sql(sql, main_db.database)

,episode_id,setting_id,series_name,season,title,date_aired,run_time,monster_real,motive,is_deleted
0,1,1.0,"Scooby Doo, Where Are You!",1,What a Night for a Knight,9/13/69,21,FALSE,Theft,0
1,2,2.0,"Scooby Doo, Where Are You!",1,A Clue for Scooby Doo,9/20/69,22,FALSE,Theft,0
2,3,3.0,"Scooby Doo, Where Are You!",1,Hassle in the Castle,9/27/69,21,FALSE,Treasure,0
3,4,4.0,"Scooby Doo, Where Are You!",1,Mine Your Own Business,10/4/69,21,FALSE,Natural Resource,0
4,5,5.0,"Scooby Doo, Where Are You!",1,Decoy for a Dognapper,10/11/69,21,FALSE,Competition,0
...,...,...,...,...,...,...,...,...,...,...
540,573,NaN,test series 9,9,test 9,test date 9,9,FALSE,test motive 9,0
541,577,NaN,test series 15,9,test 9,test date 9,9,FALSE,test motive 9,0
542,578,NaN,test series 20,9,test 9,test date 9,9,FALSE,test motive 9,0
543,579,NaN,test series 21,9,test 9,test date 9,9,FALSE,test motive 9,1
544,580,NaN,test series 1,1,test 1,test date 1,1,FALSE,test motive 1,0